# Akses Localhost dengan Python

## Koneksi MySQL dan Python

In [33]:
# import module 
import mysql.connector

# koneksi server
db1 = mysql.connector.connect(
  host='localhost',
  user='bakti',
  passwd='123'
)

## Memeriksa Daftar Database

In [34]:
# membuat objek 'cursor` sebagai kata kunci eksekusi SQL
cursor1 = db1.cursor()

# Perintah SQL
sql = 'SHOW DATABASES'

# Eksekusi perintah  SQL
cursor1.execute(sql)

# menampilkan daftar database
for data in cursor1:
  print(data)

('information_schema',)
('jne2',)
('mysql',)
('performance_schema',)
('phpmyadmin',)
('toko_mainan',)

## Membuat Database Baru

In [ ]:
sql= 'CREATE DATABASE jne2'
cursor1.execute(sql)

## Menghapus Database

In [ ]:
sql= 'DROP DATABASE jne2'
cursor1.execute(sql)

## Memeriksa Tabel Dari Database

In [35]:
# import module 
import mysql.connector

# koneksi salah satu database MySQl ke Python
db2 = mysql.connector.connect(
  host='localhost',
  user='bakti',
  passwd='123',
  database='jne2'
)

# membuat objek 'cursor` sebagai kata kunci eksekusi SQL
cursor2 = db2.cursor()

# Perintah SQL
sql = "SHOW TABLES"

# Eksekusi perintah  SQL
cursor2.execute(sql)

# menampilkan daftar tabel
for x in cursor2:
  print(x)

('distribution_centers',)
('events',)
('inventory_items',)
('order_items',)
('orders',)
('products',)
('user',)
('users',)

# CRUD Lanjut

In [31]:
import pandas as pd

link_data = 'https://raw.githubusercontent.com/dsciencelabs/JNE_Data_Analytics_PySQL/main/data/data_latihan/users.csv'

df1 = pd.read_csv(link_data, sep=';' )
df1.head(5)

,id,first_name,last_name,email,age,gender,state,street_address,postal_code,city,country,latitude,longitude,traffic_source,created_at
0,44184,Patricia,Martinez,patriciamartinez@example.net,36,F,Acre,09526 Hudson Vista Suite 861,69917-400,Rio Branco,Brasil,"-9,945567619","-67,83560991",Search,6/27/2023 6:07:04
1,48555,Daniel,Mckinney,danielmckinney@example.com,67,M,Acre,4676 Kurt Heights,69917-400,Rio Branco,Brasil,"-9,945567619","-67,83560991",Search,10/24/2020 4:57:00
2,80173,Regina,Hudson,reginahudson@example.org,61,F,Acre,20365 Boyd Spur Suite 939,69917-400,Rio Branco,Brasil,"-9,945567619","-67,83560991",Display,1/3/2022 7:23:00
3,85798,Kenneth,Montes,kennethmontes@example.org,16,M,Acre,0604 Dorothy Cliff Suite 086,69917-400,Rio Branco,Brasil,"-9,945567619","-67,83560991",Search,2/18/2023 6:55:00
4,88855,Zachary,Petersen,zacharypetersen@example.com,22,M,Acre,8398 Flores Dale,69917-400,Rio Branco,Brasil,"-9,945567619","-67,83560991",Search,1/27/2022 17:30:00

## Create Tabel dari CSV

In [11]:
pip install pymysql

Requirement already satisfied: pymysql in c:\users\user\anaconda3\lib\site-packages (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [12]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\user\anaconda3\lib\site-packages (2.0.16)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\user\anaconda3\lib\site-packages (from sqlalchemy) (4.4.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\user\anaconda3\lib\site-packages (from sqlalchemy) (2.0.1)
Note: you may need to restart the kernel to use updated packages.

In [36]:
import pymysql
from sqlalchemy import create_engine

# membuat engine
engine = create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}"
                       .format(user="bakti",
                               pw="123",
                               db="jne2"))

# df1.to_sql('users', engine, if_exists = 'append', index = True)
df1.to_sql('users', engine, if_exists='replace', index = False)

500

## Read Dataframe

In [40]:
import pandas as pd

en_co = engine.connect()

read1 = pd.read_sql_table('orders', en_co)
read1.head(5)

,order_id,user_id,status,gender,created_at,returned_at,shipped_at,delivered_at,num_of_item
0,21,17,Shipped,F,5/30/2023 12:56:00,NaN,6/1/2023 9:50:00,NaN,1
1,24,18,Shipped,F,8/2/2022 17:28:00,NaN,8/3/2022 8:35:00,NaN,1
2,26,19,Shipped,F,2/12/2023 3:39:00,NaN,2/13/2023 12:59:00,NaN,1
3,33,22,Shipped,F,3/3/2021 1:23:00,NaN,3/3/2021 14:04:00,NaN,1
4,34,23,Shipped,F,2/14/2023 17:47:00,NaN,2/14/2023 18:20:00,NaN,1